tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "ngrok/ngrok"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Dependency manager for Cocoa projects
brew "cocoapods"
# C library implementing the SSH2 protocol
brew "libssh2"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Generic library support script
brew "libtool"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Distributed revision control system
brew "git"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Postgres C API library
brew "libpq"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Implementation of Telnet and SSH
brew "putty"
# Display and control your Android device
brew "scrcpy"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Display management tool
cask "betterdisplay"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Collaboration platform for API development
cask "postman"
# Rust-based terminal
cask "warp"
vscode "humao.rest-client"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "pkief.material-icon-theme"
vscode "vscodevim.vim"
